                  # comparision operator ตัวดำเนินการเปรียบเทียบ
        #  ต้องมีข้อมูลอย่างน้อย 2 ค่า
        #  ชนิดข้อมูลเหมือนกัน
        #  คำตอบ 2  คำตอบ

x, y, z = 5, 7, 9

print(" ค่า x มากกว่า  y หรือไม่ : ", x > y)
print(" ค่า x น้อยกว่า  y หรือไม่ : ", x < y)
print(" ค่า x เท่ากับ  y หรือไม่ : ", x == y)
print(" ค่า x ไม่เท่ากับ  y หรือไม่ : ", x != y)


#หรือ or
print(" ค่า x มากกว่าหรือเท่ากับ  y หรือไม่ : ", x >= y)
print(" ค่า x  น้อยกว่าหรือเท่ากับ  y หรือไม่ : ", x <= y)

# เเละ and
print(" ค่า x มากกว่า  y มากกว่า z หรือไม่ : ", x > y > z)
print(" ค่า x น้อยกว่า y น้อยกว่า z หรือไม่ : ", x < y < z)

